'use client'

import TextItem from "@/components/mainPage/question/TextItems";
import { useState } from "react";

const texts = [
    { text: 'آیا می‌توانم فیلم‌های موجود در فیلیمو را دانلود کنم؟',
        details: 'بله، شما می‌توانید همه فیلم‌ و سریال‌های فیلیمو را داخل خود اپلیکیشن فیلیمو دانلود کنید و برای زمان‌هایی که اینترنت ندارید یا در سفر، هواپیما و قطار آ‌ن‌ها را تماشا کنید. برای دانلود هم از طریق رایانه و هم از طریق خود اپلیکیشن فیلیمو می‌توانید اقدام‌کنید. برای جزییات بیشتر می‌توانید فیلم‌های آموزشی مربوط به دانلود از طریق سایت و دانلود از طریق اپلیکیشن را تماشا کنید.'
    },
    { text: 'آیا فیلیمو برای خارج از ایران در دسترس است؟',
        details: 'خیر. درحال حاضر تماشای فیلیمو فقط در داخل کشور فعال است و امکان تماشا برای افراد خارج از کشور فعال نیست.     '
    },
    { text: 'آیا برای تماشای فیلم‌های اکران آنلاین، باید اشتراک بخرم؟',
        details: 'تماشای فیلم‌های اکران آنلاین مانند تماشا در سینمای واقعی است؛ یعنی برای دیدن هر فیلم که در اکران آنلاین است باید بلیت تهیه کنید و به جای رفتن به سالن سینما، 8 ساعت فرصت دارید که آن فیلم را از داخل خانه تماشا کنید.'
    },
    { text: 'از کجا می‌توانم نرم‌افزار اندروید یا iOS فیلیمو را دانلود کنم؟',
        details: 'برای نصب نرم‌افزار اندرویدی فیلیمو می‌توانید ازطریق کافه بازار یا مایکت اقدام به دانلود کنید. یا می‌توانید روی گزینه روبرو بزنید و به‌طور مستقیم فایل نرم‌افزار را دریافت کنید. دانلود مستقیم نرم‌افزار اندروید برای دانلود نرم‌افزار iOS فیلیمو نیز کافیست روی گزینه روبرو بزنید و به‌طور مستقیم فایل نرم‌افزار را دریافت کنید. دانلود مستقیم نرم‌افزار iOS'
    },
];

const Question = () => {
    const [selectedText, setSelectedText] = useState(null);
    const handleTextClick = (text) => {
        setSelectedText(prevSelectedText => (prevSelectedText === text ? null : text));
    };

    return (
        <div className='container w-[90%] sm:w-[85%] lg:w-[70%] mx-auto py-8 mt-16 '>
            <h1 className='text-center text-white mb-2'>سوالات متداول</h1>
            <p className='text-center text-gray-300 text-xs mb-8'>سوال شایع دیگر کاربران شاید برای شما پیش امده باشد</p>
            <ul>
                {texts.map((textObj, index) => (
                    <TextItem
                        key={index}
                        textObj={textObj}
                        isOpen={selectedText === textObj.text}
                        onClick={handleTextClick}
                    />
                ))}
            </ul>
        </div>
    );
};

export default Question;